ChibiOS/ChibiOS-Contrib/os/hal/ports/SILABS/LLD/EFR32FG23/GPIOv1/hal_pal_lld.h
/*
    ChibiOS - Copyright (C) 2024 Xael South

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    GPIOv1/hal_pal_lld.h
 * @brief   EFR32 PAL low level driver header.
 *
 * @addtogroup PAL
 * @{
 */

#ifndef HAL_PAL_LLD_H
#define HAL_PAL_LLD_H

#if HAL_USE_PAL || defined(__DOXYGEN__)

/*===========================================================================*/
/* Unsupported modes and specific modes                                      */
/*===========================================================================*/

/**
 * @name    EFR32-specific I/O mode flags
 * @{
 */
#define PAL_EFR32_CTRL_SLEWRATE_DEFAULT        GPIO_P_CTRL_SLEWRATE_DEFAULT
#define PAL_EFR32_CTRL_DINDIS_DEFAULT          GPIO_P_CTRL_DINDIS_DEFAULT
#define PAL_EFR32_CTRL_SLEWRATEALT_DEFAULT     GPIO_P_CTRL_SLEWRATEALT_DEFAULT
#define PAL_EFR32_CTRL_DINDISALT_DEFAULT       GPIO_P_CTRL_DINDISALT_DEFAULT


#define PAL_EFR32_PORTA_CTRL_DEFAULT           (PAL_EFR32_CTRL_SLEWRATE_DEFAULT    | \
                                                PAL_EFR32_CTRL_DINDIS_DEFAULT      | \
                                                PAL_EFR32_CTRL_SLEWRATEALT_DEFAULT | \
                                                PAL_EFR32_CTRL_DINDISALT_DEFAULT)

#define PAL_EFR32_PORTB_CTRL_DEFAULT           (PAL_EFR32_CTRL_SLEWRATE_DEFAULT    | \
                                                PAL_EFR32_CTRL_DINDIS_DEFAULT      | \
                                                PAL_EFR32_CTRL_SLEWRATEALT_DEFAULT | \
                                                PAL_EFR32_CTRL_DINDISALT_DEFAULT)

#define PAL_EFR32_PORTC_CTRL_DEFAULT           (PAL_EFR32_CTRL_SLEWRATE_DEFAULT    | \
                                                PAL_EFR32_CTRL_DINDIS_DEFAULT      | \
                                                PAL_EFR32_CTRL_SLEWRATEALT_DEFAULT | \
                                                PAL_EFR32_CTRL_DINDISALT_DEFAULT)

#define PAL_EFR32_PORTD_CTRL_DEFAULT           (PAL_EFR32_CTRL_SLEWRATE_DEFAULT    | \
                                                PAL_EFR32_CTRL_DINDIS_DEFAULT      | \
                                                PAL_EFR32_CTRL_SLEWRATEALT_DEFAULT | \
                                                PAL_EFR32_CTRL_DINDISALT_DEFAULT)


#define PAL_EFR32_MODEL_DEFAULT                 GPIO_P_MODEL_MODE0_DEFAULT
#define PAL_EFR32_MODEL_DISABLED                GPIO_P_MODEL_MODE0_DISABLED
#define PAL_EFR32_MODEL_INPUT                   GPIO_P_MODEL_MODE0_INPUT
#define PAL_EFR32_MODEL_INPUTPULL               GPIO_P_MODEL_MODE0_INPUTPULL
#define PAL_EFR32_MODEL_INPUTPULLFILTER         GPIO_P_MODEL_MODE0_INPUTPULLFILTER
#define PAL_EFR32_MODEL_PUSHPULL                GPIO_P_MODEL_MODE0_PUSHPULL
#define PAL_EFR32_MODEL_PUSHPULLALT             GPIO_P_MODEL_MODE0_PUSHPULLALT
#define PAL_EFR32_MODEL_WIREDOR                 GPIO_P_MODEL_MODE0_WIREDOR
#define PAL_EFR32_MODEL_WIREDORPULLDOWN         GPIO_P_MODEL_MODE0_WIREDORPULLDOWN
#define PAL_EFR32_MODEL_WIREDAND                GPIO_P_MODEL_MODE0_WIREDAND
#define PAL_EFR32_MODEL_WIREDANDFILTER          GPIO_P_MODEL_MODE0_WIREDANDFILTER
#define PAL_EFR32_MODEL_WIREDANDPULLUP          GPIO_P_MODEL_MODE0_WIREDANDPULLUP
#define PAL_EFR32_MODEL_WIREDANDPULLUPFILTER    GPIO_P_MODEL_MODE0_WIREDANDPULLUPFILTER
#define PAL_EFR32_MODEL_WIREDANDALT             GPIO_P_MODEL_MODE0_WIREDANDALT
#define PAL_EFR32_MODEL_WIREDANDALTFILTER       GPIO_P_MODEL_MODE0_WIREDANDALTFILTER
#define PAL_EFR32_MODEL_WIREDANDALTPULLUP       GPIO_P_MODEL_MODE0_WIREDANDALTPULLUP
#define PAL_EFR32_MODEL_WIREDANDALTPULLUPFILTER GPIO_P_MODEL_MODE0_WIREDANDALTPULLUPFILTER


#define PAL_EFR32_PORTA_MODEL_DEFAULT           ((PAL_EFR32_MODEL_DEFAULT <<  0U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT <<  4U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT <<  8U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 12U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 16U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 20U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 24U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 28U))

#define PAL_EFR32_PORTB_MODEL_DEFAULT           ((PAL_EFR32_MODEL_DEFAULT <<  0U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT <<  4U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT <<  8U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 12U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 16U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 20U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 24U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 28U))

#define PAL_EFR32_PORTC_MODEL_DEFAULT           ((PAL_EFR32_MODEL_DEFAULT <<  0U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT <<  4U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT <<  8U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 12U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 16U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 20U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 24U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 28U))

#define PAL_EFR32_PORTD_MODEL_DEFAULT           ((PAL_EFR32_MODEL_DEFAULT <<  0U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT <<  4U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT <<  8U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 12U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 16U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 20U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 24U) | \
                                                 (PAL_EFR32_MODEL_DEFAULT << 28U))


#define PAL_EFR32_MODEH_DEFAULT                 GPIO_P_MODEH_MODE0_DEFAULT
#define PAL_EFR32_MODEH_DISABLED                GPIO_P_MODEH_MODE0_DISABLED
#define PAL_EFR32_MODEH_INPUT                   GPIO_P_MODEH_MODE0_INPUT
#define PAL_EFR32_MODEH_INPUTPULL               GPIO_P_MODEH_MODE0_INPUTPULL
#define PAL_EFR32_MODEH_INPUTPULLFILTER         GPIO_P_MODEH_MODE0_INPUTPULLFILTER
#define PAL_EFR32_MODEH_PUSHPULL                GPIO_P_MODEH_MODE0_PUSHPULL
#define PAL_EFR32_MODEH_PUSHPULLALT             GPIO_P_MODEH_MODE0_PUSHPULLALT
#define PAL_EFR32_MODEH_WIREDOR                 GPIO_P_MODEH_MODE0_WIREDOR
#define PAL_EFR32_MODEH_WIREDORPULLDOWN         GPIO_P_MODEH_MODE0_WIREDORPULLDOWN
#define PAL_EFR32_MODEH_WIREDAND                GPIO_P_MODEH_MODE0_WIREDAND
#define PAL_EFR32_MODEH_WIREDANDFILTER          GPIO_P_MODEH_MODE0_WIREDANDFILTER
#define PAL_EFR32_MODEH_WIREDANDPULLUP          GPIO_P_MODEH_MODE0_WIREDANDPULLUP
#define PAL_EFR32_MODEH_WIREDANDPULLUPFILTER    GPIO_P_MODEH_MODE0_WIREDANDPULLUPFILTER
#define PAL_EFR32_MODEH_WIREDANDALT             GPIO_P_MODEH_MODE0_WIREDANDALT
#define PAL_EFR32_MODEH_WIREDANDALTFILTER       GPIO_P_MODEH_MODE0_WIREDANDALTFILTER
#define PAL_EFR32_MODEH_WIREDANDALTPULLUP       GPIO_P_MODEH_MODE0_WIREDANDALTPULLUP
#define PAL_EFR32_MODEH_WIREDANDALTPULLUPFILTER GPIO_P_MODEH_MODE0_WIREDANDALTPULLUPFILTER


#define PAL_EFR32_PORTA_MODEH_DEFAULT           ((PAL_EFR32_MODEH_DEFAULT <<  0U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT <<  4U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT <<  8U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 12U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 16U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 20U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 24U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 28U))

#define PAL_EFR32_PORTB_MODEH_DEFAULT           ((PAL_EFR32_MODEH_DEFAULT <<  0U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT <<  4U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT <<  8U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 12U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 16U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 20U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 24U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 28U))

#define PAL_EFR32_PORTC_MODEH_DEFAULT           ((PAL_EFR32_MODEH_DEFAULT <<  0U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT <<  4U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT <<  8U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 12U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 16U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 20U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 24U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 28U))

