ChibiOS/ChibiOS-Contrib/os/hal/ports/SILABS/LLD/EFR32FG23/GPIOv1/hal_pal_lld.h
#define PAL_EFR32_PORTD_MODEH_DEFAULT           ((PAL_EFR32_MODEH_DEFAULT <<  0U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT <<  4U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT <<  8U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 12U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 16U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 20U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 24U) | \
                                                 (PAL_EFR32_MODEH_DEFAULT << 28U))


#define PAL_EFR32_DINT_DEFAULT                  GPIO_P_DIN_DIN_DEFAULT
#define PAL_EFR32_PORTA_DIN_DEFAULT             PAL_EFR32_DIN_DEFAULT
#define PAL_EFR32_PORTB_DIN_DEFAULT             PAL_EFR32_DIN_DEFAULT
#define PAL_EFR32_PORTC_DIN_DEFAULT             PAL_EFR32_DIN_DEFAULT
#define PAL_EFR32_PORTD_DIN_DEFAULT             PAL_EFR32_DIN_DEFAULT


#define PAL_EFR32_DOUT_DEFAULT                  GPIO_P_DOUT_DOUT_DEFAULT
#define PAL_EFR32_PORTA_DOUT_DEFAULT            PAL_EFR32_DOUT_DEFAULT
#define PAL_EFR32_PORTB_DOUT_DEFAULT            PAL_EFR32_DOUT_DEFAULT
#define PAL_EFR32_PORTC_DOUT_DEFAULT            PAL_EFR32_DOUT_DEFAULT
#define PAL_EFR32_PORTD_DOUT_DEFAULT            PAL_EFR32_DOUT_DEFAULT


#define PAL_EFR32_MODE_SHIFT                      (0U)
#define PAL_EFR32_MODE_MASK                       (0xFU << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_DISABLED                   ( 0U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_INPUT                      ( 1U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_INPUTPULL                  ( 2U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_INPUTPULL_FILTER           ( 3U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_PUSHPULL                   ( 4U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_PUSHPULL_ALT               ( 5U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_WIREDOR                    ( 6U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_WIREDOR_PULLDOWN           ( 7U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_WIREDAND                   ( 8U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_WIREDAND_FILTER            ( 9U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_WIREDAND_PULLUP            (10U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_WIREDAND_PULLUP_FILTER     (11U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_WIREDAND_ALT               (12U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_WIREDAND_ALT_FILTER        (13U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_WIREDAND_ALT_PULLUP        (14U << PAL_EFR32_MODE_SHIFT)
#define PAL_EFR32_MODE_WIREDAND_ALT_PULLUP_FILTER (15U << PAL_EFR32_MODE_SHIFT)


#define PAL_EFR32_DOUT_SHIFT                    (4U)
#define PAL_EFR32_DOUT_MASK                     (1U << PAL_EFR32_DOUT_SHIFT)
#define PAL_EFR32_DOUT_LOW                      (0U << PAL_EFR32_DOUT_SHIFT)
#define PAL_EFR32_DOUT_PULLDOWN                 (0U << PAL_EFR32_DOUT_SHIFT)
#define PAL_EFR32_DOUT_FLOATING                 (0U << PAL_EFR32_DOUT_SHIFT)
#define PAL_EFR32_DOUT_HIGH                     (1U << PAL_EFR32_DOUT_SHIFT)
#define PAL_EFR32_DOUT_PULLUP                   (1U << PAL_EFR32_DOUT_SHIFT)
#define PAL_EFR32_DOUT_FILTER                   (1U << PAL_EFR32_DOUT_SHIFT)


#define PAL_EFR32_ALTERNATE_FUNCSEL_SHIFT       (5U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_MASK        (0xFFU << PAL_EFR32_ALTERNATE_FUNCSEL_SHIFT)
#define PAL_EFR32_ALTERNATE_FUNCSEL(n)          (  (n) << PAL_EFR32_ALTERNATE_FUNCSEL_SHIFT)
#define PAL_EFR32_ALTERNATE_FUNCSEL_NONE        PAL_EFR32_ALTERNATE_FUNCSEL(0U)

#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART0_RX_DIS PAL_EFR32_ALTERNATE_FUNCSEL(1U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART0_TX_DIS PAL_EFR32_ALTERNATE_FUNCSEL(2U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART0_RX     PAL_EFR32_ALTERNATE_FUNCSEL(3U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART0_TX     PAL_EFR32_ALTERNATE_FUNCSEL(4U)

#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART1_RX_DIS PAL_EFR32_ALTERNATE_FUNCSEL(5U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART1_TX_DIS PAL_EFR32_ALTERNATE_FUNCSEL(6U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART1_RX     PAL_EFR32_ALTERNATE_FUNCSEL(7U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART1_TX     PAL_EFR32_ALTERNATE_FUNCSEL(8U)

#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART2_RX_DIS PAL_EFR32_ALTERNATE_FUNCSEL(9U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART2_TX_DIS PAL_EFR32_ALTERNATE_FUNCSEL(10U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART2_RX     PAL_EFR32_ALTERNATE_FUNCSEL(11U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_EUSART2_TX     PAL_EFR32_ALTERNATE_FUNCSEL(12U)

#define PAL_EFR32_ALTERNATE_FUNCSEL_USART0_RX_DIS  PAL_EFR32_ALTERNATE_FUNCSEL(13U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_USART0_TX_DIS  PAL_EFR32_ALTERNATE_FUNCSEL(14U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_USART0_RX      PAL_EFR32_ALTERNATE_FUNCSEL(15U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_USART0_TX      PAL_EFR32_ALTERNATE_FUNCSEL(16U)

#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT0_NOCLOCK   PAL_EFR32_ALTERNATE_FUNCSEL(17U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT0_FSRCO     PAL_EFR32_ALTERNATE_FUNCSEL(18U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT0_HFXO      PAL_EFR32_ALTERNATE_FUNCSEL(19U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT0_HFRCODPLL PAL_EFR32_ALTERNATE_FUNCSEL(20U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT0_HFRCOEM23 PAL_EFR32_ALTERNATE_FUNCSEL(21U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT0_LFXO      PAL_EFR32_ALTERNATE_FUNCSEL(22U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT0_LFRCO     PAL_EFR32_ALTERNATE_FUNCSEL(23U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT0_ULFRCO    PAL_EFR32_ALTERNATE_FUNCSEL(24U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT0_HCLK      PAL_EFR32_ALTERNATE_FUNCSEL(25U)

#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT1_NOCLOCK   PAL_EFR32_ALTERNATE_FUNCSEL(26U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT1_FSRCO     PAL_EFR32_ALTERNATE_FUNCSEL(27U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT1_HFXO      PAL_EFR32_ALTERNATE_FUNCSEL(28U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT1_HFRCODPLL PAL_EFR32_ALTERNATE_FUNCSEL(29U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT1_HFRCOEM23 PAL_EFR32_ALTERNATE_FUNCSEL(30U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT1_LFXO      PAL_EFR32_ALTERNATE_FUNCSEL(31U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT1_LFRCO     PAL_EFR32_ALTERNATE_FUNCSEL(32U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT1_ULFRCO    PAL_EFR32_ALTERNATE_FUNCSEL(33U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT1_HCLK      PAL_EFR32_ALTERNATE_FUNCSEL(34U)

