ChibiOS/ChibiOS-Contrib/os/hal/ports/SILABS/LLD/EFR32FG23/GPIOv1/hal_pal_lld.h
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT2_NOCLOCK   PAL_EFR32_ALTERNATE_FUNCSEL(35U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT2_FSRCO     PAL_EFR32_ALTERNATE_FUNCSEL(36U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT2_HFXO      PAL_EFR32_ALTERNATE_FUNCSEL(37U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT2_HFRCODPLL PAL_EFR32_ALTERNATE_FUNCSEL(38U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT2_HFRCOEM23 PAL_EFR32_ALTERNATE_FUNCSEL(39U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT2_LFXO      PAL_EFR32_ALTERNATE_FUNCSEL(40U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT2_LFRCO     PAL_EFR32_ALTERNATE_FUNCSEL(41U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT2_ULFRCO    PAL_EFR32_ALTERNATE_FUNCSEL(42U)
#define PAL_EFR32_ALTERNATE_FUNCSEL_CLKOUT2_HCLK      PAL_EFR32_ALTERNATE_FUNCSEL(43U)

/**
 * @brief   Alternate function.
 *
 * @param[in] n         alternate function selector
 */
#define PAL_MODE_ALTERNATE(n)                   PAL_EFR32_ALTERNATE_FUNCSEL_##n
/** @} */


#undef PAL_MODE_RESET
#undef PAL_MODE_UNCONNECTED
#undef PAL_MODE_INPUT
#undef PAL_MODE_INPUT_PULLUP
#undef PAL_MODE_INPUT_PULLDOWN
#undef PAL_MODE_INPUT_ANALOG
#undef PAL_MODE_OUTPUT_PUSHPULL
#undef PAL_MODE_OUTPUT_OPENDRAIN

#define PAL_MODE_RESET                          (PAL_EFR32_MODE_DISABLED  | \
                                                 PAL_EFR32_DOUT_FLOATING)

#define PAL_MODE_UNCONNECTED                    (PAL_EFR32_MODE_DISABLED  | \
                                                 PAL_EFR32_DOUT_FLOATING)

#define PAL_MODE_INPUT                          (PAL_EFR32_MODE_INPUT     | \
                                                 PAL_EFR32_DOUT_FLOATING)

#define PAL_MODE_INPUT_PULLUP                   (PAL_EFR32_MODE_INPUTPULL | \
                                                 PAL_EFR32_DOUT_PULLUP)

#define PAL_MODE_INPUT_PULLDOWN                 (PAL_EFR32_MODE_INPUTPULL | \
                                                 PAL_EFR32_DOUT_PULLDOWN)

#define PAL_MODE_INPUT_ANALOG                   (PAL_EFR32_MODE_INPUT     | \
                                                 PAL_EFR32_DOUT_FLOATING)

#define PAL_MODE_OUTPUT_PUSHPULL                (PAL_EFR32_MODE_PUSHPULL  | \
                                                 PAL_EFR32_DOUT_HIGH)

#define PAL_MODE_OUTPUT_OPENDRAIN               (PAL_EFR32_MODE_WIREDAND  | \
                                                 PAL_EFR32_DOUT_PULLUP)

/*===========================================================================*/
/* I/O Ports Types and constants.                                            */
/*===========================================================================*/

/**
 * @name    Port related definitions
 * @{
 */
/**
 * @brief   Width, in bits, of an I/O port.
 */
#define PAL_IOPORTS_WIDTH           16U

/**
 * @brief   Whole port mask.
 * @details This macro specifies all the valid bits into a port.
 */
#define PAL_WHOLE_PORT              ((ioportmask_t)0xFFFFU)
/** @} */

/**
 * @name    Line handling macros
 * @{
 */
/**
 * @brief   Forms a line identifier.
 * @details A port/pad pair are encoded into an @p ioline_t type. The encoding
 *          of this type is platform-dependent.
 * @note    In this driver the pad number is encoded in the lower 4 bits of
 *          the GPIO address which are guaranteed to be zero.
 */
#define PAL_LINE(port, pad)                                                 \
  ((ioline_t)((uint32_t)(port)) | ((uint32_t)(pad)))

/**
 * @brief   Decodes a port identifier from a line identifier.
 */
#define PAL_PORT(line)                                                      \
  ((((uint32_t)(line)) & 0xFFFFFFF0U))

/**
 * @brief   Decodes a pad identifier from a line identifier.
 */
#define PAL_PAD(line)                                                       \
  ((uint32_t)((uint32_t)(line) & 0x0000000FU))

/**
 * @brief   Value identifying an invalid line.
 */
#define PAL_NOLINE                      0U
/** @} */

/**
 * @brief   GPIO port setup info.
 */
typedef struct {
  uint32_t              ctrlr;  /**< port control            */
  uint32_t              modelr; /**< mode low                */
  uint32_t              modehr; /**< mode high               */
  uint32_t              doutr;  /**< data out                */
} efr32_gpio_setup_t;

/**
 * @brief   EFR32 GPIO static initializer.
 * @details An instance of this structure must be passed to @p palInit() at
 *          system startup time in order to initialize the digital I/O
 *          subsystem. This represents only the initial setup, specific pads
 *          or whole ports can be reprogrammed at later time.
 */
typedef struct {
/** @brief Port A setup data.*/
  efr32_gpio_setup_t    PAData;
  /** @brief Port B setup data.*/
  efr32_gpio_setup_t    PBData;
  /** @brief Port C setup data.*/
  efr32_gpio_setup_t    PCData;
  /** @brief Port D setup data.*/
  efr32_gpio_setup_t    PDData;
} PALConfig;

/**
 * @brief Digital I/O port sized unsigned type.
 */
typedef uint32_t ioportmask_t;

/**
 * @brief   Digital I/O modes.
 */
typedef uint32_t iomode_t;

/**
 * @brief   Type of an I/O line.
 */
typedef uint32_t ioline_t;

/**
 * @brief   Type of an event mode.
 */
typedef uint32_t ioeventmode_t;

/**
 * @brief   Port Identifier.
 * @details This type can be a scalar or some kind of pointer, do not make
 *          any assumption about it, use the provided macros when populating
 *          variables of this type.
 */
typedef uint32_t ioportid_t;

/**
 * @brief   Type of an pad identifier.
 */
typedef uint32_t iopadid_t;

/*===========================================================================*/
/* I/O Ports Identifiers.                                                    */
/* The low level driver wraps the definitions already present in the EFR32   */
/* firmware library.                                                         */
/*===========================================================================*/

/**
 * @brief   GPIO port A identifier.
 */
#if EFR32_HAS_GPIOA || defined(__DOXYGEN__)
#define GPIOA           GPIO_PA_INDEX
#define IOPORT1         GPIOA
#endif

/**
 * @brief   GPIO port B identifier.
 */
#if EFR32_HAS_GPIOB || defined(__DOXYGEN__)
#define GPIOB           GPIO_PB_INDEX
#define IOPORT2         GPIOB
#endif

/**
 * @brief   GPIO port C identifier.
 */
#if EFR32_HAS_GPIOC || defined(__DOXYGEN__)
#define GPIOC           GPIO_PC_INDEX
#define IOPORT3         GPIOC
#endif

/**
 * @brief   GPIO port D identifier.
 */
#if EFR32_HAS_GPIOD || defined(__DOXYGEN__)
#define GPIOD           GPIO_PD_INDEX
#define IOPORT4         GPIOD
#endif

#define GPIO_PORT_INDEX(port) (port)

#define GPIO_PORT(port)       (&(GPIO->P[GPIO_PORT_INDEX(port)]))

#define GPIO_PORT_SIZE(port)  ((port == GPIOA) ? GPIO_PA_COUNT : \
                               (port == GPIOB) ? GPIO_PB_COUNT : \
                               (port == GPIOC) ? GPIO_PC_COUNT : \
                               (port == GPIOD) ? GPIO_PD_COUNT : \
                               0)

